import React from "react";
import css from './header.module.css';


const HeaderComponent = ({ toggleAccount, toggleBurgerMenu }) => {
    return (
        <header className={css.header}>
            <div className={css.logo}>
                <svg xmlns="http://www.w3.org/2000/svg" width="72" height="46" viewBox="0 0 72 46" fill="none">
                    <path d="M36.4291 40.2113C40.8678 40.9831 43.2104 44.392 43.8269 46H35.5851H35.5044V18.9859C36.4291 13.5187 40.313 2.19854 48.4505 0.654878C56.5881 -0.888788 61.7049 0.654878 63.2461 1.61967C55.8483 1.61967 48.4505 9.338 45.6763 13.1972L43.0548 16.56L40.2536 21.16L38.9389 23.7508C38.5709 24.476 38.2554 25.2266 37.9948 25.997L37.8479 26.4312C36.9775 29.0041 36.807 31.7621 37.3538 34.4226L39.2033 27.6691C40.7445 22.2019 46.971 12.0394 59.5472 15.1268C72.1234 18.2141 72.8015 28.6339 71.5686 33.4578C70.6438 30.2418 66.76 23.6169 58.6224 22.8451C50.4849 22.0733 43.9885 24.84 43.8269 26.7043C45.1603 26.0837 46.6172 25.7556 48.088 25.747C48.9399 25.742 49.7995 25.8571 50.5612 26.2385C56.0835 29.0034 56.4259 35.9319 55.8483 39.2465L52.1494 34.4226L50.3 32.493L48.4505 31.5281C40.313 29.2126 37.0456 36.3521 36.4291 40.2113Z" fill="#2BA9F2" />
                    <path d="M35.5709 40.2113C31.1322 40.9831 28.7896 44.392 28.1731 46H36.4149H36.4956V18.9859C35.5709 13.5187 31.687 2.19854 23.5495 0.654878C15.4119 -0.888788 10.2951 0.654878 8.75394 1.61967C16.1517 1.61967 23.5495 9.338 26.3237 13.1972L28.9452 16.56L31.7464 21.16L33.0611 23.7508C33.4291 24.476 33.7446 25.2266 34.0052 25.997L34.1521 26.4312C35.0225 29.0041 35.193 31.7621 34.6462 34.4226L32.7967 27.6691C31.2555 22.2019 25.029 12.0394 12.4528 15.1268C-0.123398 18.2141 -0.801521 28.6339 0.431442 33.4578C1.35617 30.2418 5.24 23.6169 13.3776 22.8451C21.5151 22.0733 28.0115 24.84 28.1731 26.7043C26.8397 26.0837 25.3828 25.7556 23.912 25.747C23.0601 25.742 22.2005 25.8571 21.4388 26.2385C15.9165 29.0034 15.5741 35.9319 16.1517 39.2465L19.8506 34.4226L21.7 32.493L23.5495 31.5281C31.687 29.2126 34.9544 36.3521 35.5709 40.2113Z" fill="#2BA9F2" />
                </svg>
                <h1>Oasis</h1>
            </div>
            <nav className={css.menu}>
                <span>Игровой зал</span>
                <span>Турниры</span>
                <span>Зал славы</span>
                <span>Бонусы</span>
            </nav>
            <div className={css.payment}>
                <div className={css.paymentBtn} onClick={toggleAccount}>
                    <svg width="25px" height="25px" viewBox="0 -0.5 21 21" version="1.1" xmlns="http://www.w3.org/2000/svg" fill="#ffffff">
                        <g id="SVGRepo_bgCarrier" strokeWidth="2px"></g>
                        <g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <g id="Page-1" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                                <g id="Dribbble-Light-Preview" transform="translate(-259.000000, -600.000000)" fill="#ffffff">
                                    <g id="icons" transform="translate(56.000000, 160.000000)">
                                        <path d="M214.55,449 L217.7,449 L217.7,451 L214.55,451 L214.55,454 L212.45,454 L212.45,451 L209.3,451 L209.3,449 L212.45,449 L212.45,446 L214.55,446 L214.55,449 Z M213.5,458 C208.86845,458 205.1,454.411 205.1,450 C205.1,445.589 208.86845,442 213.5,442 C218.13155,442 221.9,445.589 221.9,450 C221.9,454.411 218.13155,458 213.5,458 L213.5,458 Z M213.5,440 C207.70085,440 203,444.477 203,450 C203,455.523 207.70085,460 213.5,460 C219.29915,460 224,455.523 224,450 C224,444.477 219.29915,440 213.5,440 L213.5,440 Z" id="plus_circle-[#ffffff]">
                                        </path>
                                    </g>
                                </g>
                            </g>
                        </g>
                    </svg>
                    <span>Пополнить счёт</span>
                </div>
                <div className={css.burgerMenu}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="18" height="14" viewBox="0 0 18 14" fill="none" onClick={toggleBurgerMenu}>
                        <path d="M0 1H18" stroke="white" />
                        <path d="M0 7H18" stroke="white" />
                        <path d="M0 13H18" stroke="white" />
                    </svg>
                </div>
            </div>

        </header>
    );
};

export { HeaderComponent }