import React from "react";
import css from './footer.module.css';


const FooterComponent = () => {
    return (
        <footer className={css.footer}>
            <div className={css.top}>
                <span>платёжные системы</span>
                <div className={css.slider}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="115" height="10" viewBox="0 0 115 10" fill="none">
                        <circle opacity="0.2" cx="26" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="5" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="47" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="68" cy="5" r="5" fill="white" />
                        <circle cx="89" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="110" cy="5" r="5" fill="white" />
                    </svg>
                </div>
            </div>
            <div className={css.center}>
                <aside className={css.centerAside}>
                    <span>О нас</span>
                    <span>Новости</span>
                    <span>Правила и условия</span>
                    <span>Лицензия</span>
                    <span>Антиблокировка</span>
                </aside>
                <section>
                    damn 123 — это популярная площадка с автоматами лучших провайдеров. Заведение обеспечивает честное
                    проведение игровых сессий, безопасность финансовых операций и своевременность выплаты выигрышей.
                    Для внесения
                    депозита предлагаются около десяти надежных способов. Деньги мгновенно поступают на счет.
                    Ставить их на раунды
                    можно круглосуточно. Средний уровень теоретической отдачи по залу составляет 496%
                    В некоторых версиях азартных
                    игр этот показатель достигает 995%.

                    <p>Для зарегистрированных пользователей в казино проводятся турниры с большим призовым фондом и лотереи с ценными
                        призами. С официального сайта можно скачать приложение для компьютера или мобильного устройства. После установки
                        программы для посещения зала пользоваться браузером не понадобится. Вход будет открываться с рабочего стола ПК и
                        дисплея телефона.
                    </p>
                </section>
            </div>
            <div className={css.bottomForIPad}>
                <div>
                    <span>
                        <svg className={css.svgLetter} xmlns="http://www.w3.org/2000/svg" width="34" height="25" viewBox="0 0 34 25" fill="#F8F8F8">
                            <path d="M30.2222 0H3.77778C2.77585 0 1.81496 0.398015 1.10649 1.10649C0.398015 1.81496 0 2.77585 0 3.77778V20.7778C0 21.7797 0.398015 22.7406 1.10649 23.4491C1.81496 24.1575 2.77585 24.5556 3.77778 24.5556H30.2222C31.2241 24.5556 32.185 24.1575 32.8935 23.4491C33.602 22.7406 34 21.7797 34 20.7778V3.77778C34 2.77585 33.602 1.81496 32.8935 1.10649C32.185 0.398015 31.2241 0 30.2222 0ZM11.9302 13.8191L14.9562 16.4636C15.5323 16.966 16.2614 17.2153 17 17.2153C17.7386 17.2153 18.4677 16.9641 19.0438 16.4636L22.0698 13.8191L21.9999 13.889L28.8868 20.7759H5.11322L12.0001 13.889L11.9302 13.8191ZM3.77778 19.4423V6.68667L10.5816 12.6386L3.77778 19.4423ZM23.4184 12.6386L30.2222 6.68667V19.4367L23.4184 12.6386ZM30.2222 3.77778V4.17444L17.8009 15.0431C17.5734 15.2246 17.291 15.3234 17 15.3234C16.709 15.3234 16.4266 15.2246 16.1991 15.0431L3.77778 4.17444V3.77778H30.2222Z" fill="#F8F8F8" />
                        </svg>support@dammn123.com
                    </span>
                    <div style={{ "display": "flex", "alignItems": "flexEnd" }}>
                        <svg className={css.cInCircle} width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <circle cx="8" cy="8" r="7.5" stroke="white" strokeWidth="1px" />
                            <path d="M5.336 8.248C5.336 7.768 5.42133 7.336 5.592 6.952C5.76267 6.568 5.98933 6.25867 6.272 6.024C6.55467 5.784 6.86933 5.60267 7.216 5.48C7.56267 5.35733 7.92533 5.296 8.304 5.296C8.87467 5.296 9.40533 5.41867 9.896 5.664V6.552C9.496 6.27467 9.016 6.136 8.456 6.136C7.864 6.136 7.352 6.31467 6.92 6.672C6.488 7.02933 6.26933 7.55467 6.264 8.248C6.264 8.68533 6.376 9.06133 6.6 9.376C6.824 9.69067 7.09867 9.91733 7.424 10.056C7.74933 10.1947 8.09867 10.264 8.472 10.264C9.06933 10.264 9.55733 10.12 9.936 9.832V10.736C9.43467 10.9813 8.89333 11.104 8.312 11.104C7.93867 11.104 7.57867 11.0453 7.232 10.928C6.88533 10.8053 6.568 10.6293 6.28 10.4C5.992 10.1707 5.76267 9.86933 5.592 9.496C5.42133 9.12267 5.336 8.70667 5.336 8.248Z" fill="white" />
                        </svg>
                        <span>
                            damn 123 - онлайн казино
                        </span>
                    </div>
                </div>
                <div>
                    <span style={{ "borderBottom": "1px solid" }}>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</span>
                    <span style={{ "borderBottom": "1px solid" }}>ОНЛАЙН - ПОМОЩНИК</span>
                </div>
                <div className={css.sliderForIPad}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="115" height="10" viewBox="0 0 115 10" fill="none">
                        <circle opacity="0.2" cx="26" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="5" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="47" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="68" cy="5" r="5" fill="white" />
                        <circle cx="89" cy="5" r="5" fill="white" />
                        <circle opacity="0.2" cx="110" cy="5" r="5" fill="white" />
                    </svg>
                </div>

            </div>
            <div className={css.bottom}>

                <span id={css.titleForPhone}>Платежные системы</span>
                <span>
                    <svg className={css.svgLetter} xmlns="http://www.w3.org/2000/svg" width="34" height="25" viewBox="0 0 34 25" fill="#F8F8F8">
                        <path d="M30.2222 0H3.77778C2.77585 0 1.81496 0.398015 1.10649 1.10649C0.398015 1.81496 0 2.77585 0 3.77778V20.7778C0 21.7797 0.398015 22.7406 1.10649 23.4491C1.81496 24.1575 2.77585 24.5556 3.77778 24.5556H30.2222C31.2241 24.5556 32.185 24.1575 32.8935 23.4491C33.602 22.7406 34 21.7797 34 20.7778V3.77778C34 2.77585 33.602 1.81496 32.8935 1.10649C32.185 0.398015 31.2241 0 30.2222 0ZM11.9302 13.8191L14.9562 16.4636C15.5323 16.966 16.2614 17.2153 17 17.2153C17.7386 17.2153 18.4677 16.9641 19.0438 16.4636L22.0698 13.8191L21.9999 13.889L28.8868 20.7759H5.11322L12.0001 13.889L11.9302 13.8191ZM3.77778 19.4423V6.68667L10.5816 12.6386L3.77778 19.4423ZM23.4184 12.6386L30.2222 6.68667V19.4367L23.4184 12.6386ZM30.2222 3.77778V4.17444L17.8009 15.0431C17.5734 15.2246 17.291 15.3234 17 15.3234C16.709 15.3234 16.4266 15.2246 16.1991 15.0431L3.77778 4.17444V3.77778H30.2222Z" fill="#F8F8F8" />
                    </svg>support@dammn123.com
                </span>
                <div style={{ "display": "flex", "alignItems": "center" }}>
                    <svg className={css.cInCircle} width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="8" cy="8" r="7.5" stroke="white" strokeWidth="1px" />
                        <path d="M5.336 8.248C5.336 7.768 5.42133 7.336 5.592 6.952C5.76267 6.568 5.98933 6.25867 6.272 6.024C6.55467 5.784 6.86933 5.60267 7.216 5.48C7.56267 5.35733 7.92533 5.296 8.304 5.296C8.87467 5.296 9.40533 5.41867 9.896 5.664V6.552C9.496 6.27467 9.016 6.136 8.456 6.136C7.864 6.136 7.352 6.31467 6.92 6.672C6.488 7.02933 6.26933 7.55467 6.264 8.248C6.264 8.68533 6.376 9.06133 6.6 9.376C6.824 9.69067 7.09867 9.91733 7.424 10.056C7.74933 10.1947 8.09867 10.264 8.472 10.264C9.06933 10.264 9.55733 10.12 9.936 9.832V10.736C9.43467 10.9813 8.89333 11.104 8.312 11.104C7.93867 11.104 7.57867 11.0453 7.232 10.928C6.88533 10.8053 6.568 10.6293 6.28 10.4C5.992 10.1707 5.76267 9.86933 5.592 9.496C5.42133 9.12267 5.336 8.70667 5.336 8.248Z" fill="white" />
                    </svg>
                    <span>
                        damn 123 - онлайн казино
                    </span>
                </div>
                <span style={{ "borderBottom": "1px solid" }}>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</span>
                <span style={{ "borderBottom": "1px solid" }}>ОНЛАЙН - ПОМОЩНИК</span>
            </div>
        </footer>
    );
};

export { FooterComponent }